6.F22_30ms_CFD/Allrun
#https://github.com/frixlee/openfoam_cases

#!/bin/bash

foamListTimes -rm 

surfaceFeatures

blockMesh

snappyHexMesh -overwrite

patchSummary

potentialFoam

simpleFoam